# 추후엔 stations_metadata 형식의 json이나 table형식으로 보관해야한다.
line_stations = {
    '1호선': ['다대포해수욕장', '다대포항', '낫개', '신장림', '장림', '동매', '신평', '하단', '당리', '사하', '괴정', '대티', '서대신', '동대신', '토성', '자갈치', '남포', '중앙', '부산역', '초량', '부산진', '좌천', '범일', '범내골', '1서면', '부전', '양정', '시청', '1연산', '교대', '1동래', '명륜', '온천장', '부산대', '장전', '구서', '두실', '남산', '범어사', '노포'],

    '2호선': ['장산', '중동', '해운대', '동백', '벡스코', '센텀시티', '민락', '수영', '광안', '금련산', '남천', '경성대부경대', '대연', '못골', '지게골', '문현', '국제금융센터', '전포', '2서면', '부암', '가야', '동의대', '개금', '냉정', '주례', '감전', '사상', '덕포', '모덕', '모라', '구남', '구명', '2덕천', '수정', '화명', '율리', '동원', '금곡', '호포', '부산대양산', '증산', '남양산', '양산'],

    '3호선': ['망미', '배산', '물만골', '3연산', '거제', '종합운동장', '사직', '미남', '만덕', '남산정', '숙등', '3덕천', '구포', '강서구청', '체육공원', '대저'],

    '4호선': ['4동래', '수안', '낙민', '충렬사', '명장', '서동', '금사', '반여농산물', '석대', '영산대', '윗반송', '고촌', '안평'],

    '환승역': ['1서면', '2서면', '1연산', '3연산', '1동래', '4동래', '2덕천', '3덕천', '수영']
}
